<template>
    <div class="articles">
        <banner></banner>
        <div class="site-content animate">
            <!-- 文章目录 -->
            <!-- <div id="article-menus">
                <menu-tree :menus="menus" child-label="child"></menu-tree>
            </div> -->
            <main class="site-main">
                <article class="hentry">
                    <!-- 文章头部 -->
                    <header class="entry-header">
                        <!-- 标题输出 -->
                        <h1 class="entry-title">深圳合租记</h1>
                        <hr>
                        <div class="breadcrumbs">
                            <div id="crumbs">最后更新时间：2021年02月01日</div>
                        </div>
                    </header>
                    <!-- 正文输出 -->
                    <div class="entry-content">
                        <p>@[TOC]</p>
                        <h4 id="引言：">引言：</h4>
                        <p>2020年8月10号，从郑州抵达到深圳！！！</p>
                        <h4>始</h4>
                        <p style="text-indent: 2em;">不做长篇言论，直接入题。2020年8月9号，和前端几个同学决定一块出发到深圳，和张云鹏老师一块坐火车，晚上老师给我们上了一课，感觉似乎有点悬乎，但我们还是鼓着勇气决定去拼了一把。长达十几个小时的路程，晚上倒是有点疲惫 ，一觉睡到了天亮，最后还是因为车厢内有千年一遇的呼噜王 ，迫使我连懒觉真的睡不下去了，然后下床去看外边的风景。</p>
                        <hr>
                        <h4>中</h4>
                        <pre><code> ~~~~~长达十几个小时的路程终于到达了深圳，老师领着我们出去了之后做了好长时间的地铁，在地铁上，见到了南方各种各样plmm，来到了一线城市中，什么都没有感觉到，只感觉到了一股股的压力，在地铁中的人不一定都是高高兴兴的过来，高高兴兴的回去，在他们的眼里能够感觉得到，有一种压迫感，看着他们打着电话还笑嘻嘻的，这种笑嘻嘻的是那种开开心心的笑嘻嘻吗，谁也猜不准他是在应付着谁，也许是自己的客户，也许是自己的上司，更希望是对自己家人的笑嘻嘻。</code></pre>
                        <hr>
                        <h4>抵达</h4>
                        <blockquote>
                            <p style="text-indent: 2em;">做了好长时间的地铁，终于下来了，8月份的天气对于深圳还算可以，毕竟深圳是一个恒温的城市，每天都是这个温度，还是很不错的，不算太热，也不算太冷，拉着重重的行李箱，背着重重的鞋 ，还拖拉着一个拖鞋，这种天气走很长时间还是挺累挺热的，似乎感觉到了绝望，自己在大城市中打拼真的不是那么好拼的，当时心里一直在想奥利给，真的是没办法，终于老师带着我们五个来到了一个8人间的宿舍，还是那么的挤，房价还是那么的贵，刚来到这里，坐火车的400多块钱都是问家人要的，实在不想再去问家人要钱，但最后也是没办法，还是要了1500块钱交了房租，忽然有种想放弃的感觉，曾经和家人说过的去大城市发展，现在一开始却问家人要那么多的钱，实在于心不忍，住着这既拥挤又贵的宿舍，但又不得不住，也许这就是大城市吧，先苦后甜，也是一点点打拼而来的，谁一开始不是努力打拼着，心里无时无刻的想，不要急，慢慢的造，人有多大胆，定有多大产。加油！！！奥利给。</p>
                            <p  style="text-indent: 2em;">来到这里，生活用品什么都没有，都要去出去买，也是要花钱的喽，出去简简单单的买了一点东西，牙刷牙膏，盆等等，回去之后，今天算是很疲惫的一天，也是简简单单的把床铺了一下，倒在床上不那么一会就睡着了，毕竟第二天早上还要早起投递简历，找工作的风波就这样到来了</p>
                        </blockquote>
                        <hr>
                        <ol start="2">
                            <li>面试史
                                <blockquote>
                                    <p style="text-indent: 2em;">第二天早上，也就是8月11号，前天晚上老师说今天要在前程无忧投递上300份简历，这个东西也是第一次用 ，还有boss直聘，智联招聘，根本不知道各个公司是什么样的一个进展，我们在前程无忧做了一个筛选，把自己合适的职位筛选出来，好在这东西能一次投递50份简历，搜上三下，150份就这样投递出去了，虽然是筛选，但什么样的公司都有，不过一会，室友的电话开始响了起来，一个比一个忙，收到了各个公司的邀请面试，而我的电话还是一往平静，没有任何消息，前程无忧投递完之后，也去了boss直聘，boss直聘的是直接可以和各个公司的前台联系，前台感觉合适的话，就直接面试邀请，还是挺不错的，几个小时下来，他们都各自有了后一天的面试邀请，在吃饭的时候，一个公司好像注意到了我，但他们的效率是真的慢，等的我燥火，吃完饭之后，终于有一家公司给我打电话了，也就是后一天早上的面试，更巧的是，我和我的室友去了同一家公司，下午依然在联系，但效果几乎都不是太好。</p>
                                    <p style="text-indent: 2em;">第二天是上午10点的面试，我和我室友也不敢迟到，老早的起来了，那天还是下着雨，确实感觉到了一丝丝的心累，到了那地方之后，我和我室友都傻眼了，这个公司竟然是在一个居民楼上边，但是在云和的时候，张鹏浩说如果是居民楼的什么什么公司最好不要去，有可能是小黑屋哦，不过我们两个想 ，来都来了，就要去上面看一看，我问了一下张云鹏老师，他说的没有关系，可以去，我们也没有管那么多，直接就进去了，进去之后我们两个就傻眼了，这个公司里一共才见到3个人，真的是无语了，更懵逼的是，老板直接让我们俩上机操作，虽然我们俩是培训机构培训出来的，但实力还是不允许，就像老师之前说过的，虽然是培训出来的，但我们出去找工作真的是什么都不是，我现在终于相信这句话了</p>
                                    <p style="text-indent: 2em;">长达1个多小时的上机，真正感觉到了困难，在学习的时候那是写的什么项目，什么都不算，到了真正的实战，真的是看一脸懵逼，琢磨了好久，才算是写出来一个简单的渲染，但这点并不代表什么，老板根本不看在眼里，最后老板以委婉的接口让我们走了，说的是什么他们需要实力过硬的，我当时就想去你妹的吧，也不看看自己是什么公司，还要实力过硬的，垃圾的一批，我们两个下楼之后，外边突然下起了大雨，那是真的大，还好带了伞，天空灰蒙蒙的下着雨，我们两个的心情都不是太好，下午还有各自的一个面试，我们两个吃过饭之后就分开头去面试了，下午的是在南山区，在当时的龙岗区过去那边是真的远，也只好吃过饭直接打了公交过去，刚上去公交没多久，就又下起了大雨，在车上坐了大概将近两个小时，下车之后大雨还在下，只好一手拿手机导航，一手拿雨伞，生活不得不迫使我去坚持，到了楼下之后，问了一个人之后才知道这个公司的位置，乘电梯上去了，刚到里边，前台直接给我了一份面试题，感觉这才是真正的面试，上午的那家那是啥，面试题很简答，我一会写完了， 也有一两道难得，不过都让我百度了出来，等了好久之后，才有人让我去面试，第一次真正面试的我以为面试时多么严肃的一件事，然而没有什么好害怕的，我甚至一点紧张都没有，虽然是不害怕，但让这个人直接给我问懵逼了，毕竟自己是没有在公司经历过的，还有我们的简历也是造假出来的，不造假的话面试的机会是很少的，我们也只能搏一搏，假装自己是在公司待过一年的人，但我第一次正儿八经的面试，好像这个人看出了我不是真正的一年的经验，毕竟写项目根本不着边，随便说了几分钟后，这个人就直接说让我回去等通知，我知道一般这样的结果是不会有结果，但我还是自信满满，他爱要不要，我就当是经历了，仅仅面试了一天，我差不多已经找到了感觉，回去之后继续投递简历，等待邀请面试，第二天上午的面试我依然还是和我室友面试的同一家。</p>
                                </blockquote>
                            </li>
                        </ol>
                        <hr>
                        <h4>经验搏一搏</h4>
                        <blockquote>
                            <p style="text-indent: 2em;">犹如昨天晚上老师说的一样，对于在公司面试，要把自己的信息拿出来，没有过没关系，关键在于吸收经验。另一方面，既然都假装了，要假装出自己很牛逼的样子，这样才可能让面试的人信服你，哪怕你是真的不会，也要硬气的去说一说，错就错了，没有什么关系。</p>
                            <p style="text-indent: 2em;">我怀揣着信心，和室友来到了这一家公司，这家公司也是一二十人的样子，但工资给的也不是太高，我直接进去碰一碰运气，进来的这个人说话有点傻逼，眼睛还那么有点斜，他问我的问题也都是基础的，偶尔也会有那么一点难得，关于这点难得，我直接硬气的和他怼，他说我说的这个答案对吗，我说的对，其实这是不对的，但我还是这样去说，因为我不可能后退，不要让他以为自己很弱的样子，毕竟气场不能认输，和这个人对峙了几十分钟后，然后他们的人事来了，然后又哔哔了好几分钟，然后让我等通知，这次的面试我很舒畅，毕竟我的气场拿出来了，输赢倒是无所谓，然后我室友进去面试了，我在外面也是等了好长时间，最后他也出来了，感觉还都挺不错，因为我面试了一天之后，大概的道理和规矩也都差不多明白了，公司里边的怎么去面试一个人，我似乎也是明白了，这一家我感觉有70的几率，我把能说的都说了 ，气场这一块我也是拿的死死的，从不输于任何人，这一家算是结束了，然后准备吃饭去下一家，刚吃过饭，外面就又下起了大雨，似乎有点难，再难也要坚持下去，吃完饭看了一下手机，下一家离的也是太远了，就在这时，又有一家公司给我打电话，此时我的面试已经排到了下周的周一。</p>
                        </blockquote>
                        <h4>万万没想到</h4>
                        <blockquote>
                            <p style="text-indent: 2em;">
                                挂了电话之后，灰蒙蒙的sky，雨下的越来越大了，我手中的小umbrella都快招架不住了，一手撑着伞，一手拿着手机看那该死的高德瞎几把导航的地图，大城市中那么好的信号，但网真是差的一批，就这样跟着这不好使的地图终于找到了一个公交车站牌，这一家的公司很远，关键是我当时从龙岗的最东边赶到南山的最南边，十万八千里的距离，差不多就是横穿了整个深圳的样子，中间我转了好几辆公交车，远的确实过分，到了地方之后，眼前的一幕让我大吃一惊，好家伙，这地方也他么的太繁华了吧，别说进公司了，就只看见眼前这情景，就让我感觉到了压力山大，跟着导航又走了好几百米，正好下车时雨已经停了，当时的天气很凉爽，到了公司楼下，好好的感受了这真正大城市的样子，这个公司是入驻在一个名字叫卫星大厦的大厦中，关于这个大厦为什么叫卫星大厦，我也不清楚，看起来是很牛逼的样子，然后我进去问门口的保安，我问了一下这个公司是不是在这个大厦中，当然他可能也不知道，因为大厦中入驻的公司太多了，因为我是真的不知道这里边的实情是什么样的，我配合着保安的登记以后，我进去了电梯内，这公司是在8楼802，到了8楼，看着这高端上档次的写字楼，真的是，无法描述。
                            </p>
                        </blockquote>
                        <h4>成功之日</h4>
                        <blockquote>
                            <p style="text-indent: 2em;">
                                我进入这个公司之后，有一个人看到了我，然后问我是不是面试的，我一口答应了，然后他让我稍等一会，一会后，应该是前台的小姐姐让我进入了会议室，开始面试，进来的面试官是一个比我大几岁的，他拿着我的简历开始问我问题，从这个面试官的语言中我能体会到他应该是一个很会体谅的一个人，非常不错，然而我这次来并没有打着面试成功的心理来的，因为这个地方离我住的地方太远了，而且这个地方的生存环境已经让我感受到了压力，以前说大城市有压力的，只是说说而已，并没有那么严重，而当你真正去到了大城市当中你会发现，其实压力还是挺大的，和这个面试官聊了一点时间之后会发现，这个面试官没有去难为人的意思，因为大家都明白，每个人都是这样进来的，打工人没必要去互相为难，反正比之前的任意一家公司的面试官好上一百倍，当然我也有没有回答出来的问题，而他是慢慢的给我解释了一遍是为什么，我也听的很认真，也是虚心的学到了，完后，他又让我等了一会，接下来又来了一个面试官，他说他是这个公司技术部的技术经理，从外表上看起来很普普通通，也许他有着内在的实力，他先介绍了一遍他自己，我又介绍了一遍我自己，之后他让我说了一个vue的双向绑定原理，天哪，在学习的时候，我都是一直用，从来没有去了解过什么什么原理，我很不好意思的坑了几句，很明显是不对的，他说这么基础的问题都不会，我也没有说什么，因为这家公司的面试官人都不错，我没有想怼的意思，令我没有想到的是，他好像对我很认可，我们也是聊了很长时间的家常，因为他说他像我这么大的时候，已经外漂好多年了，到今，也是有一二十年的社会经验了，而他经历的人也是有很多，就连商丘的人他也是认识了不少，河南话也会说那么少许，况且他是一个湖南人，然后他让我摘下口罩说让我们互相看一看，免得以后在公司碰到以后还是那么的生疏，我在想，他是什么意思，难道说我面试成功了，而且我并没有打着面试成功的心理来的，这地方确实有点那个什么，我还是不太相信，他说着我的年龄还是很小的，在他看来，一番对话之后，我心理感觉都挺好的，虽然这次我回答的不是很好，不像之前，我虽然回答的不好，但我还是坚持了我的意见，关键还是看公司面试官的人品，在这之前的所有公司的面试官，我他么真想干死他，感觉自己好牛逼的样子，然后这个经理又让我稍等了一会，具体什么情况，我也不知道，我就在会议室待了一会，过了一会，又来了一个前端面试的，这个前台的让我先去大厅坐着等一会，我四处望了望，这个公司整体氛围还是不错的，还看见了两个好看的小姐姐，不一会，这里的人资把我叫到了会议室，我一开始想着自己介绍一遍来着，他说的不用了，然后又了解了我的生活，等一些面试技巧中常问到的问题，我回答的都很好，接着就谈到了薪资的问题，我的面试单上面写着6-7k，这个工资其实并不高，我也是对我自己衡量了一下，决定了就是这个数目，我心里一想，看来这次有戏了，但又一想，这地方是很让我感到不适，并不是很想来的意思，我并没有拒绝，先答应了下来，最后说他们的前台过会会给我打个电话通知我一下，然后给我发offer，就这样，整个面试流程过去了，我满怀欣喜又不太喜欢的走了，然后去了趟厕所，看到这厕所，我真是，这厕所简直比我住的地方还要香，尿了一泡之后，我准备离开了，我走到电梯口，看到刚刚进去面试的那一位，正在拿着他自己记的笔记背着，还是css的那一块，我只是感到了一种心酸和努力付出获得回报的心情，我走出了这栋大厦，拿起高德地图，又导航了回去的路线，又是走了好远的距离才到了公交站牌，我在想每天都是这样很长时间的路程肯定是扛不住的，决定是一定要坐地铁了，虽然坐地铁也是很长时间吧，但比起公交来讲，省了很长的时间和路程加上精力，我又一次深深的叹了一口气！！！
                            </p>
                        </blockquote>
                        <h4>打道回府</h4>
                        <blockquote>
                            <p style="text-indent: 2em;">
                                从大厦出来后，随着高德地图的导航来到了一个公交站牌，此时我才刚发现，我现在处在的位置是百度大厦，没有想到我现在的位置竟然是中国很牛逼的公司大厦下，上了车之后，我和张云鹏打电话说一下我今天的情况，他说我要的这个工资是刚刚好，作为一个专科生，而且还是应届生直接出来面试，能拿到这个薪资也是不错的，他让我再继续面试，看还有没有更好的结果，此时，我心里参杂着欣喜还有些不爽，我心里很是徘徊，一方面想着这个地方实在是太远，又一方面想着其他公司也不是好面试的，薪资基本都是这个价了，毕竟自己是刚出来，默默的从心里窜出三个字，随缘吧。走到中间换乘的时候，就突然偶遇到我室友也在等同一辆车回去，看着他面无表情，就感觉也不是太顺利，不过我们都是打着试着的心态去面试，没有成功，也不是太难受，心态问题还是挺重要的，一天天的即使没有成功，但我们也是积累着经验的，再一个就是不要灰心，说不定哪一天运气就来了，我把我今天的经历也给室友说了，也说了一些面试的技巧，在他们看来，我已经通过了这次的面试，他们感觉都挺好的， 但我实在不知道该说些什么，我还想再继续面试，在那个公司的时候，人事给我说过会会给我打电话，我也一直在等，希望是能先把这份offer拿到手，我还是接着继续面试其他公司，如果能成功的话，我再考虑考虑，如果你能成功的话，我就直接进这家公司，也是没有办法的，今天是周四，明天周五也有一家，也是在南山区，一样的感觉，面试只是经历，结果随天了。
                            </p>
                        </blockquote>
                        <h4>继续面试</h4>
                        <blockquote>
                            <p style="text-indent: 2em;">
                                今天周五，老郭俺俩的面试都是在南山区，今天把姓王的也给叫过来了，玩上一天，顺便请教请教经验，上午又是坐了许久的公交车，先是直接到我面试的地方，南山什么什么云谷，搞的挺洋气的一样，没什么卵用，当然老郭的是在南山的科技园，都是下午的面试，吃完饭以后，我进去面试了，让我等了好久，说好的是一点半，愣是让我等了半个多小时，其实他们是两点上班，但不知道为什么让我一点半去面试，这不是扯淡了吗，真的是不想鸟他们公司，进去之后，有一个前台小姐姐，长得还挺好看，不一会，来了一个面试官，让我去会议室进行面试，令我没有想到的是他问我的问题还都挺另类的，是专门做h5动画的，但是我对于这方面，还真是不熟，关于h5的动画我做的确实不是太多，基本都是写一些实用性的项目，他们这公司完全就是给别人搞宣传，做一些广告的动画图，我不会，我承认我不会，我也不和他怼什么，我就默默的听他讲，谁知道他一讲就是半个多小时，听的我是真难受，第一次见这么徐吊的，不管了，我就这么听下去，有些话他说了等于是放屁一样，就不能直接入主题，到最后还是来了一句，你期待的薪资是多少，让我回去等通知，你他么的早一点说不完事了，等到最后还是等到的这一句话，我之前听你那么多的屁话有什么用，真的是浪费我感情，出来之后，这个姓王的就已经在楼下等了我好久，我也不管那么多了，俺俩先去找一个地方玩一会，等着老郭，毕竟我现在也是在等我昨天的那个offer，做了一辆公交车后，我们俩绕到了塘朗山下，准备在塘朗山下等着老郭，然后再一起玩，俺俩再路边等了好大一会，我也等的迫不及待，我给昨天的那个公司打电话问他一下什么时候发offer，我好去准备一下，当然这并不是我的目的，我的目的是我在这里到底有没有被录取，我打了电话确认了一下，说的是要准备给我打电话，看来是赶到一块去了，然后又问我许多的问题，然后就把电话挂了，然后就直接给我发来了一份offer到我的邮箱里，我仔细看了看offer，心里也是暗暗自喜，因为这是我人生中的第一份offer，我决定存一个档，就这样，我们在塘朗山下走了好大一会，才碰见老郭，当时我已经是累的不行，碰面之后，我们去了一趟图书馆，我也没有什么想看的，天生不爱看书，密密麻麻，字可多，可烦，然后我就拿了一本书假装看了一会，看了一会之后，感觉没有什么意思了，我们三个也准备出去了，再去其他的地方转一转，对面刚好有一个商场，我们上去逛了一逛，此时我感觉我已经是精疲力尽，我也不知道怎么回事，完后，我和老郭找到公交车坐车回去，今天是周五，回去之后好好的歇息一下，明天周六我还有一家面试。
                            </p>
                        </blockquote>
                        <h4>继续面试2</h4>
                        <blockquote>
                            <p style="text-indent: 2em;">
                                今天是周六，上午有一家面试，是在龙岗区，离的也有点距离，二话不说，坐上公交车直接就是出发，到了地方之后看了一下，他么的这地方也是有点荒凉，不知道这边是干嘛的，我没有管那么多，直接就进去了，进去之后更他么的让我吃惊，他么的这公司就3个人，还能不能再可怜点，而且面试的时候还是一次性两个面试官，除了这两个面试官之外，就只有一个人在上班了，这玩个屁啊，一上来就问我那么另类的问题，我他么一个前端的，让我那么懂数据库的语言，我直接说我不会，又能怎么着，还问我有没有公司录用我，有没有公司录用我管你们什么吊事，再一次的询问，不行就是不行，哪来的那么多的废话，终于我说了一些结尾的话，赶紧撤，一刻都不想待，况且我要的工资也不高，你们他么的还想要个资历深的，有资历深的也不去你们这样的公司，就能让人一下干死的那种，扯淡吧，迈起大步，直接走出去，出去之后，找个没人的地方尿了个尿，准备起步回去，此时，结束了我这次的所有的面试，其实在下周一还有一家公司，但我真的不想去了，决定就这一家了，深圳秒加，继续等回去的公交车，准备耍个几天然后去上班，今天已经是周六了，还有三天的时间，周三让我去入职，但我还有准备工作，要去办一个工商银行卡，还有毕业证复印件，还要去医院做一个入职体检，事情还真是挺多的。
                            </p>
                        </blockquote>
                        <h4>面试结束</h4>
                        <blockquote>
                            <p style="text-indent: 2em;">
                                回去之后，他们都在宿舍，此时，李德生还在赶来深圳的路上，他是到下午才能来到，在宿舍还是一直的玩，到了下午，李德生快到了，我下楼去接他，看他已经是精疲力尽了，我也是体会过他的那种感觉，我帮他拉着行李箱，上了楼，等他收拾收拾，然后下去一起去吃个饭，这次出去他还要买一点生活用品，所以我们决定去远一点的地方吃饭，走了很远，我们来到了一个小餐馆，随便的要了点面，吃完以后，他们想去附近的一个什么什么山，我感觉李德生都不带累的，手里还惦着一提纸，我还穿着一个拖鞋，然后我们就去上山了，走着不一会，我们到了山脚下，这是一个盘山公路，要绕着走很远才能走到山顶，走了一会就能听到各种生物的叫声，真的是很刺激，不知道是走了多久，走到了一个小溪的地方，这地方的人还是挺多的，
                            </p>
                        </blockquote>
                        <pre><code> 未完待续~~~</code></pre>
                    </div>
                    <!-- 文章底部 -->
                    <section-title>
                        <footer class="post-footer">
                            <!-- 阅读次数 -->
                            <div class="post-like">
                                <i class="iconfont iconeyes"></i>
                                <span class="count">685</span>
                            </div>
                            <!-- 文章标签 -->
                            <div class="post-tags">
                                <i class="iconfont iconcategory"></i>Web
                            </div>
                        </footer>
                    </section-title>
                    <!--声明-->
                    <div class="open-message">
                        <p>声明：大林哥官网|版权所有，违者必究|如未注明，均为原创|本网站采用<a href="https://creativecommons.org/licenses/by-nc-sa/3.0/" target="_blank">BY-NC-SA</a>协议进行授权</p>
                    </div>
                </article>
            </main>
        </div>
    </div>
</template>

<script>
    import Banner from '@/components/banner'
    import sectionTitle from '@/components/section-title'
    import menuTree from '@/components/menu-tree'
    import './css/articles.less'
    export default {
        name: 'articles',
        data(){
          return{
              showDonate: false,
              menus: []
          }
        },
        components: {
            Banner,
            sectionTitle,
            menuTree
        },
        methods: {
          fetchH(arr,left,right){
              if (right) {
                  return arr.filter(item => item.offsetTop > left && item.offsetTop < right)
              }else {
                  return arr.filter(item => item.offsetTop > left)
              }
          },
          // 生成目录
          createMenus(){
              let arr = []
              for(let i=6;i>0;i--){
                  let temp = []
                  let e = document.querySelector(".entry-content").querySelectorAll(`h${i}`)
                  for (let j=0;j<e.length;j++){
                      let child = this.fetchH(arr,e[j].offsetTop,(j+1 === e.length)?undefined:e[j+1].offsetTop)
                      temp.push({
                          h: i,
                          title: e[j].innerText,
                          id: e[j].id,
                          offsetTop: e[j].offsetTop,
                          child
                      })
                  }
                  if (temp.length){
                      arr = temp
                  }
              }
              this.menus = arr
          }
        },
        mounted(){
            this.createMenus()
        },
        created() {
            
        }
    }
</script>